INSERT INTO user_role (role)
VALUES
('user'),
('administrator'),
('moderator');


INSERT INTO clinic (address, phone, schedule_clinic)
VALUES
('г.Санкт-Петербург, пр.Королева, д.57',  '+7(812)123-45-67', 'Пн-пт 10-19'),
('г.Санкт-Петербург, ул.Савушкина, д.141', '+7(812)212-15-18', 'Пн-пт 10-19'),
('г.Санкт-Петербург, пр.Науки, д.35', '+7(812)521-35-35', 'Пн-пт 10-19'),
('г.Санкт-Петербург, ул.Хасанская, д.22 к.1', '+7(812)345-18-21', 'Пн-пт 10-19');



INSERT INTO doctor_position  (position)
VALUES
('Хирург'),
('Врач общей практики'),
('Зоопсихолог'),
('Кинолог');


INSERT INTO pet_type  (type)
VALUES
('Собаки'),
('Кошки'),
('Грызуны'),
('Морские питомцы'),
('Птицы');


INSERT INTO price_list  (service, price, doctor_position_id)
VALUES
('Первичный прием', 1000, 2),
('Повторный прием', 700, 2),
('Консультация кинолога', 1500, 4),
('Консультация зоопсихолога', 1000, 3),
('Кастрация кошки', 2000, 1),
('Кастрация собаки', 4000, 1),
('Анализ крови', 1500 , 2),
('Анализ мочи', 1000, 2),
('Вакцинация', 1000, 2),
('Узи одной области', 800, 2),
('ЭХО сердца', 1200, 2),
('Рентген', 1000, 2);


INSERT INTO doctor  (name, doctor_position_id, phone, clinic_id, cabinet)
VALUES
('Иванова Галина Петровна', 1, '+79153255050', 1, 34),
('Петров Роман Алексеевич', 2, '+79153255051', 1, 31),
('Яськова Анастасия Михайловна', 2, '+79520312019', 2, 5),
('Филиппова Мария Владимировна', 3, '+79183210120', 2, 7),
('Краснов Алексей Юрьевич', 2, '+79039708820', 3, 21),
('Федорова Юлия Дмитриевна', 2, '+79520883112', 4, 12),
('Борисов Сергей Сергеевич', 4, '+79267018625', 4, 13);


INSERT INTO client  (name, phone, email, user_role_id)
VALUES
('Алексей Янко', '+79520967410', 'esoesfiit@icloud.com', 1);


INSERT INTO pet  (pet_type_id, name, age, client_id)
VALUES
(1, 'Тейлор', 3, 1);


INSERT INTO session_list  (client_id, clinic_id, doctor_id, date_of_visit,
						   price_list_id)
VALUES
(1, 1, 2, TO_DATE('12-12-2020','dd-MM-yyyy'), 1 );


INSERT INTO pet_medical_card ( doctor_id, pet_id, info, date_of_visit)
VALUES
(2, 1, 'У собаки обнаружен атопический дерматит. Выписаны : ... . Повторный визит 25.12.2020', TO_DATE('12-12-2020','dd-MM-yyyy'));